In [1]:
import mysql.connector as conn
mydb=conn.connect(host="localhost",user="root",passwd="anshu@gmail#123")
cursor=mydb.cursor()

import pandas as pd
pd.read_sql("show databases",mydb)

             Database
0     carbon_nanotube
1          cardataset
2            customer
3  information_schema
4               mysql
5                 org
6  performance_schema
7                 sys
8           testanshu

In [2]:
cursor.execute("use org")

In [4]:
cursor.execute("show tables")

In [5]:
cursor.fetchall()

[('bonus',), ('title',), ('worker',)]

In [21]:
cursor.execute("select * from worker")

In [23]:
pd.read_sql("select * from worker",mydb)

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
7          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

# Question 1) Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [9]:
cursor.execute("select rtrim(first_name) from worker")

In [10]:
cursor.fetchall()

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

# Q-2. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

In [24]:
pd.read_sql("select distinct department from worker",mydb)

  department
0         HR
1      Admin
2    Account

In [25]:
pd.read_sql("select distinct length(department) from worker",mydb)

   length(department)
0                   2
1                   5
2                   7

# q3) Write an SQL query to fetch nth max salaries from a table.

In [53]:
pd.read_sql("select * from worker ORDER BY salary ASC limit 5,1",mydb)

# this will show 6th heighest salary

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR